{"inkVersion":20,"root":[["\n","ev",{"VAR?":"ENDING"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"ending1"},{"->":"0.7"},null]}],"nop","\n","ev",{"VAR?":"ENDING"},2,"==","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"ending2"},{"->":"0.15"},null]}],"nop","\n","ev",{"VAR?":"ENDING"},3,"==","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"ending3"},{"->":"0.23"},null]}],"nop","\n","ev",{"VAR?":"ENDING"},4,"==","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"ending4"},{"->":"0.31"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"ending1":["^The messenger gave all the internal information about the paths and the areas to the other town leader.","\n","^The leader was surprised by the riches held by the aristocrats in the town. The leader got greedy.","\n","^The leader marched to the town and snatched away all the valuables along with the precious Xurium.","\n","^The king and the commander were imprisoned along with many other influential people.","\n","^The looting destroyed the town. Many died. Those who survived preferred fleeing the town.","\n","^[ You have reached an ending. Press SPACEBAR to exit the game. ]","\n","end",{"#f":1}],"ending2":["^With the king having escaped with all the Xurinium, the commander's nightmare comes true.","\n","^A war is at at their doors and they neither have enough soldiers nor good weapons to fight with.","\n","^The commander prepares the town's defence with all they have.","\n","^The enemies arrive. The two forces clash. Most town soldiers die fighting.","\n","^The enemies take over the town and promise to implement good governance.","\n","^While there is glimmer of a hopeful future, the town people are still mourning the deaths of the fallen soldiers.","\n","^[ You have reached an ending. Press SPACEBAR to exit the game. ]","\n","end",{"#f":1}],"ending3":["^The commander imprisons the king and takes his Xurinium metal!","\n","^He orders his blacksmiths to start casting swords with Xurinium and also use it for the explosives.","\n","^The commander, now the highest authority in the town, is confident with his military power.","\n","^The enemies arrive. The two forces clash.","\n","^The strength of the town's side along with Xurinium collides with the massive size of the enemy army.","\n","^There are many deaths on both sides.","\n","^Enemies are forced to retreat.","\n","^But the battle destroys the town. The survivors flee.","\n","^[ You have reached an ending. Press SPACEBAR to exit the game. ]","\n","end",{"#f":1}],"ending4":["^The messenger hid the information of the approaching enemy.","\n","^When the large army arrived, as expected, the town folks turned on their king.","\n","^The commander surrendered.","\n","^The other town leader promised to implement good governance in this town.","\n","^They used Xurinium to further formulating a cure and for scientic research.","\n","^The messengers actions saved the town.","\n","^[ You have reached an ending. Press SPACEBAR to exit the game. ]","\n","end",{"#f":1}],"global decl":["ev",-1,{"VAR=":"TEST_FLAG"},-1,{"VAR=":"TUT_COMPLETE"},-1,{"VAR=":"MET_KING"},-1,{"VAR=":"MET_COMMANDER"},-1,{"VAR=":"MET_COMPANION"},-1,{"VAR=":"LOYALTY_TEST_RESULT"},-1,{"VAR=":"PLAYER_BETRAYED"},-1,{"VAR=":"COMPANION_BETRAYED"},-1,{"VAR=":"INVITED_TO_MEET_ENEMY_LEADER"},-1,{"VAR=":"JOINED_ENEMY"},-1,{"VAR=":"KING_ESCAPED"},-1,{"VAR=":"COMMANDER_INFORMED"},-1,{"VAR=":"ENDING"},"/ev","end",null],"#f":1}],"listDefs":{}}